In [1]:
# Top 5 Countries: United States, China, Japan, Germany, India

In [2]:
import pandas as pd

debug=True

keep_countries = ["United States", "China", "Japan", "Germany", "India"]
keep_metrics = ["country", "year", "co2", "population", "gdp", "primary_energy_consumption"]

# Import main co2 dataset
co2 = pd.read_csv("owid-co2-data.csv")

co2 = co2[keep_metrics]

if debug:
    co2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25204 entries, 0 to 25203
Data columns (total 6 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   country                     25204 non-null  object
 1   year                        25204 non-null  int64
 2   co2                         23949 non-null  float64
 3   population                  22878 non-null  float64
 4   gdp                         13538 non-null  float64
 5   primary_energy_consumption  8690 non-null   float64
dtypes: float64(4), int64(1), object(1)
memory usage: 1.2+ MB

In [3]:
co2 = co2[co2["country"].isin(keep_countries)]

if debug:
    display(co2.sample(10))

,country,year,co2,population,gdp,primary_energy_consumption
10849,India,1892,5.254,286167644.0,2.553405e+11,NaN
9433,Germany,1863,49.383,37110194.0,1.036690e+11,NaN
9490,Germany,1920,429.208,62383655.0,2.714046e+11,NaN
11945,Japan,1929,94.880,62625034.0,2.317947e+11,NaN
24035,United States,1988,5050.268,247372258.0,8.787203e+12,21925.043
10907,India,1950,61.177,376325200.0,3.543330e+11,NaN
11924,Japan,1908,37.633,47939159.0,1.137448e+11,NaN
10896,India,1939,49.381,391883882.0,4.096236e+11,NaN
10851,India,1894,5.624,287424652.0,2.657974e+11,NaN
10945,India,1988,492.144,837468938.0,1.560090e+12,1952.152

In [4]:
#  Load Coal Production Dataset

coal = pd.read_csv("coal-production-by-region.csv")
coal = coal.drop(["Code"], axis=1)

if debug:
    coal.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1762 entries, 0 to 1761
Data columns (total 3 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   Entity                 1762 non-null   object
 1   Year                   1762 non-null   int64
 2   Coal Production - TWh  1762 non-null   float64
dtypes: float64(1), int64(1), object(1)
memory usage: 41.4+ KB

In [5]:
coal = coal[coal["Entity"].isin(keep_countries)]
coal = coal.rename(columns={"Entity": "country", "Year": "year"})

if debug:
    display(coal.sample(10))

            country  year  Coal Production - TWh
318           China  2019           22154.438708
631           India  2012            2966.210461
687           Japan  1988              73.086502
487         Germany  1988            1603.598846
608           India  1989            1147.427299
1551  United States  2006            6623.418239
283           China  1984            4589.198000
622           India  2003            1954.733862
1553  United States  2008            6640.640522
700           Japan  2001              19.300217

In [6]:
co2_coal = pd.merge(co2, coal, on=["country", "year"], how="outer")

if debug:
    co2_coal.info()
    display(co2_coal.sample(10))

<class 'pandas.core.frame.DataFrame'>
Int64Index: 888 entries, 0 to 887
Data columns (total 7 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   country                     888 non-null    object
 1   year                        888 non-null    int64
 2   co2                         875 non-null    float64
 3   population                  880 non-null    float64
 4   gdp                         724 non-null    float64
 5   primary_energy_consumption  275 non-null    float64
 6   Coal Production - TWh       200 non-null    float64
dtypes: float64(5), int64(1), object(1)
memory usage: 55.5+ KB

,country,year,co2,population,gdp,primary_energy_consumption,Coal Production - TWh
149,Germany,1819,3.276,24488367.0,NaN,NaN,NaN
433,India,1940,52.382,393975786.0,4.227724e+11,NaN,NaN
447,India,1954,72.500,402578594.0,4.134060e+11,NaN,NaN
158,Germany,1828,4.540,27390685.0,NaN,NaN,NaN
214,Germany,1884,157.526,45523375.0,1.554657e+11,NaN,NaN
705,United States,1838,5.031,16520455.0,5.524312e+10,NaN,NaN
725,United States,1858,41.649,30155449.0,1.260843e+11,NaN,NaN
180,Germany,1850,15.140,33717866.0,7.680590e+10,NaN,NaN
387,India,1894,5.624,287424652.0,2.657974e+11,NaN,NaN
263,Germany,1933,364.981,67701081.0,3.742410e+11,NaN,NaN

In [7]:
# Load Oil Consumption

oil = pd.read_csv("oil-consumption-by-country.csv")
oil = oil.drop(["Code"], axis=1)

if debug:
    oil.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5003 entries, 0 to 5002
Data columns (total 3 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   Entity                 5003 non-null   object
 1   Year                   5003 non-null   int64
 2   Oil Consumption - TWh  5003 non-null   float64
dtypes: float64(1), int64(1), object(1)
memory usage: 117.4+ KB

In [8]:
oil = oil[oil["Entity"].isin(keep_countries)]
oil = oil.rename(columns={"Entity": "country", "Year": "year"})

if debug:
    display(oil.sample(10))

            country  year  Oil Consumption - TWh
1596        Germany  1972            1807.816430
4708  United States  1986            8955.588794
4690  United States  1968            7457.961089
2315          Japan  2019            2033.797005
874           China  1989            1343.170796
872           China  1987            1193.055565
4707  United States  1985            8540.438153
1639        Germany  2015            1296.542263
1884          India  1980             376.816177
2279          Japan  1983            2498.727737

In [9]:
co2_coal_oil = pd.merge(co2_coal, oil, on=["country", "year"], how="outer")

if debug:
    co2_coal_oil.info()
    display(co2_coal_oil.sample(10))

<class 'pandas.core.frame.DataFrame'>
Int64Index: 888 entries, 0 to 887
Data columns (total 8 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   country                     888 non-null    object
 1   year                        888 non-null    int64
 2   co2                         875 non-null    float64
 3   population                  880 non-null    float64
 4   gdp                         724 non-null    float64
 5   primary_energy_consumption  275 non-null    float64
 6   Coal Production - TWh       200 non-null    float64
 7   Oil Consumption - TWh       280 non-null    float64
dtypes: float64(6), int64(1), object(1)
memory usage: 62.4+ KB

,country,year,co2,population,gdp,primary_energy_consumption,Coal Production - TWh,Oil Consumption - TWh
125,Germany,1795,0.447,NaN,NaN,NaN,NaN,NaN
179,Germany,1849,13.623,33466493.0,NaN,NaN,NaN,NaN
792,United States,1925,1758.098,119661215.0,1.296540e+12,NaN,NaN,NaN
844,United States,1977,4889.398,223135659.0,6.166912e+12,21151.165,NaN,10271.533514
323,Germany,1993,956.132,80428557.0,2.210102e+12,3978.087,1021.692378,1646.872823
572,Japan,1926,82.605,60064898.0,2.031580e+11,NaN,NaN,NaN
536,Japan,1890,6.756,39847686.0,7.428574e+10,NaN,NaN,NaN
738,United States,1871,103.021,41700283.0,2.021490e+11,NaN,NaN,NaN
553,Japan,1907,35.072,47394882.0,1.124659e+11,NaN,NaN,NaN
530,Japan,1884,2.957,37876116.0,NaN,NaN,NaN,NaN

In [10]:
# Load Coal Consumption Dataset

coal_cons = pd.read_csv('world-coal-consumption-1978-2020.csv')

# Comment out this line to include EU27 countries
coal_cons = coal_cons.drop(["EU27"], axis=1)
    
coal_cons = pd.melt(coal_cons, id_vars=["Year"], var_name="country", value_name="Coal Consumption - TWh")
coal_cons = coal_cons.rename(columns={"Year": "year"})

# Dataset gave values in Terajoules (supposedly??), converting to TWh
coal_cons["Coal Consumption - TWh"] = coal_cons["Coal Consumption - TWh"] / 3600

coal_cons.sample(10)

     year        country  Coal Consumption - TWh
7    1985          China                4.553597
167  2016          Japan                1.371204
76   2011          India                3.418751
27   2005          China               14.102233
157  2006          Japan                1.298607
24   2002          China                8.904888
81   2016          India                4.284401
102  1994  United States                5.512194
25   2003          China               10.614168
32   2010          China               20.819195

In [11]:
merged = pd.merge(co2_coal_oil, coal_cons, on=["country", "year"], how="outer")

if debug:
    merged.info()
    display(merged.sample(10))

<class 'pandas.core.frame.DataFrame'>
Int64Index: 888 entries, 0 to 887
Data columns (total 9 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   country                     888 non-null    object
 1   year                        888 non-null    int64
 2   co2                         875 non-null    float64
 3   population                  880 non-null    float64
 4   gdp                         724 non-null    float64
 5   primary_energy_consumption  275 non-null    float64
 6   Coal Production - TWh       200 non-null    float64
 7   Oil Consumption - TWh       280 non-null    float64
 8   Coal Consumption - TWh      172 non-null    float64
dtypes: float64(7), int64(1), object(1)
memory usage: 69.4+ KB

,country,year,co2,population,gdp,primary_energy_consumption,Coal Production - TWh,Oil Consumption - TWh,Coal Consumption - TWh
740,United States,1873,139.507,43689508.0,2.209079e+11,NaN,NaN,NaN,NaN
350,Germany,2020,644.310,83783945.0,NaN,NaN,272.000001,1169.139651,NaN
213,Germany,1883,153.093,45102238.0,1.516841e+11,NaN,NaN,NaN,NaN
543,Japan,1897,13.542,42534303.0,8.121406e+10,NaN,NaN,NaN,NaN
551,Japan,1905,29.931,46324792.0,9.886777e+10,NaN,NaN,NaN,NaN
865,United States,1998,5731.050,275175309.0,1.190603e+13,25391.342,6694.603356,10251.112311,5.872538
814,United States,1947,2485.752,152053446.0,2.070709e+12,NaN,NaN,NaN,NaN
313,Germany,1983,1011.605,77770210.0,1.784299e+12,4009.860,1642.870590,1482.448097,NaN
452,India,1959,101.561,441798571.0,4.869180e+11,NaN,NaN,NaN,NaN
294,Germany,1964,968.917,75677305.0,1.054007e+12,NaN,NaN,NaN,NaN

In [12]:
# Load Coal Consumption Dataset

cars = pd.read_csv('car_production.csv')

cars = pd.melt(cars, id_vars=["country"], var_name="year", value_name="Cars Produced - Thousands")
cars["year"] = pd.to_numeric(cars["year"])  

if debug:
    cars.info()
    display(cars.sample(10))

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 155 entries, 0 to 154
Data columns (total 3 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   country                    155 non-null    object
 1   year                       155 non-null    int64
 2   Cars Produced - Thousands  155 non-null    object
dtypes: int64(1), object(2)
memory usage: 3.8+ KB

           country  year Cars Produced - Thousands
79   United States  2005                 11946.653
28           Japan  1995                   10196.0
31         Germany  1996                    4843.0
46         Germany  1999                    5688.0
146        Germany  2019                  5076.349
41         Germany  1998                    5727.0
49   United States  1999                 13024.978
151        Germany  2020                  3833.693
51         Germany  2000                    5198.0
150          China  2020                 25225.242

In [13]:
final = pd.merge(merged, cars, on=["country", "year"], how="outer")

if debug:
    final.info()
    display(final.sample(10))

<class 'pandas.core.frame.DataFrame'>
Int64Index: 888 entries, 0 to 887
Data columns (total 10 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   country                     888 non-null    object
 1   year                        888 non-null    int64
 2   co2                         875 non-null    float64
 3   population                  880 non-null    float64
 4   gdp                         724 non-null    float64
 5   primary_energy_consumption  275 non-null    float64
 6   Coal Production - TWh       200 non-null    float64
 7   Oil Consumption - TWh       280 non-null    float64
 8   Coal Consumption - TWh      172 non-null    float64
 9   Cars Produced - Thousands   155 non-null    object
dtypes: float64(7), int64(1), object(2)
memory usage: 76.3+ KB

,country,year,co2,population,gdp,primary_energy_consumption,Coal Production - TWh,Oil Consumption - TWh,Coal Consumption - TWh,Cars Produced - Thousands
152,Germany,1822,3.631,25507128.0,NaN,NaN,NaN,NaN,NaN,NaN
218,Germany,1888,186.347,47247582.0,1.736798e+11,NaN,NaN,NaN,NaN,NaN
7,China,1906,17.111,415345852.0,NaN,NaN,NaN,NaN,NaN,NaN
736,United States,1869,93.696,39776936.0,1.946853e+11,NaN,NaN,NaN,NaN,NaN
297,Germany,1967,936.229,77357251.0,1.143923e+12,2966.376,NaN,1187.421619,NaN,NaN
283,Germany,1953,623.492,70929839.0,5.437437e+11,NaN,NaN,NaN,NaN,NaN
586,Japan,1940,153.244,72238836.0,3.562540e+11,NaN,NaN,NaN,NaN,NaN
885,United States,2018,5375.491,327096263.0,1.814065e+13,26556.388,4277.451369,10317.512122,3.735477,11297.19
483,India,1990,578.518,873277799.0,1.750993e+12,2287.880,1236.166642,694.058217,1.076865,NaN
365,India,1872,NaN,256475832.0,NaN,NaN,NaN,NaN,NaN,NaN

In [14]:
# Export

final.to_csv('dataset.csv', index=False)